{
  "bulbasaur": "Bulbasaur's viability in any standard competitive format is practically non-existent. Its NFE (Not Fully Evolved) status renders its base stats (45 HP, 49 Attack, 49 Defense, 65 Special Attack, 65 Special Defense, 60 Speed) abysmal, yielding a total stat value of 318. This critically low bulk and offensive power ensure it is outclassed by every fully evolved Pokémon, including other Grass/Poison types. While its Grass/Poison typing offers valuable resistances to Fighting, Water, Grass, Electric, and Fairy, it comes with common weaknesses to Fire, Flying, Psychic, and Ice. Its standard ability, Overgrow, is situational at best, and even its Hidden Ability, Chlorophyll, which doubles its Speed in harsh sunlight, fails to compensate for its cripplingly low offensive stats. It exists solely in NFE-specific metagames, otherwise sitting at the absolute bottom tier of competitive play.\n\nThe only \"winning strategy\" for Bulbasaur revolves entirely around abusing its Hidden Ability, Chlorophyll, under harsh sunlight to grant it a semblance of offensive presence. **Chlorophyll** is the mandatory ability. Given its non-existent bulk, a **Focus Sash** is essential to guarantee it survives at least one hit and can retaliate or apply status. Its role is highly conditional: a **special sweeper/disruptor**. An ideal moveset would be **Growth** to leverage Sun for a +2 boost to both attacks, pairing it with **Giga Drain** or **Energy Ball** for STAB Grass damage (Giga Drain offers minor recovery). **Sludge Bomb** provides crucial secondary STAB and a chance to poison. The final slot is often **Sleep Powder**, a high-risk, high-reward status move that can incapacitate a key threat if it lands, buying critical turns for a frail Pokémon like Bulbasaur.\n\nBulbasaur is emphatically **not a lead** and should only be brought onto the field mid-game or as a late-game cleaner after a reliable **Drought** user, such as Torkoal or Ninetales, has established harsh sunlight. It functions as a conditional threat or a disruptive element in a dedicated Sun team. Teammates must include a Sun setter and ideally other Pokémon that benefit from Sun, like Fire-types, to absorb hits and cover its weaknesses. Conversely, Bulbasaur must immediately flee from any opposing Pokémon that can change the weather (e.g., Drizzle, Sand Stream, Snow Warning users), as this negates its core strategy. It is also severely threatened by faster Psychic, Flying, Fire, or Ice-type attackers who can bypass its minimal bulk, and any Pokémon carrying multi-hit moves or hazards that render Focus Sash useless.",
  "ivysaur": "Ivysaur's viability in high-level competitive play is severely limited, primarily due to its nature as a non-fully evolved Pokémon. While its Grass/Poison typing offers valuable resistances to Fighting, Water, Grass, Electric, and Fairy, it still carries weaknesses to Fire, Ice, Flying, and Psychic, all common offensive types. Its base stats are simply too low across the board, with its highest being Special Attack and Special Defense at a mediocre 80, and abysmal Speed at 60. The key strength lies solely in its Hidden Ability, Chlorophyll, which doubles its Speed in harsh sunlight. Without this weather condition, Ivysaur is critically slow and lacks the bulk or power to contend with serious threats, placing it squarely in the \"untiered\" category for formats above NFE, where it sees niche sun-centric usage.\n\nTo construct a winning strategy with Ivysaur, it *must* operate as a Special Sweeper under harsh sunlight. The mandatory ability is Chlorophyll; Overgrow is insufficient for competitive impact. An Eviolite could provide some much-needed bulk, but its offensive presence is generally too low even with it, making Life Orb the preferred item to maximize its damage output. A standard move set would include Giga Drain or Energy Ball for reliable Grass STAB and Sludge Bomb for Poison STAB, offering excellent coverage against Grass, Fairy, Water, and Fighting types. The remaining slots should be dedicated to coverage moves like Earth Power to hit Fire- and Steel-types, or Growth to boost its Special Attack, especially effective in sun. EVs should be maximized in Special Attack and Speed to capitalize on its Chlorophyll boost.\n\nIvysaur's deployment is entirely conditional: it should never lead. Instead, it functions as a mid-to-late-game cleaner or wallbreaker, brought in only *after* sun has been established and immediate threats to its sun setter (e.g., Torkoal, Ninetales) have been removed or severely weakened. Synergistic teammates include any Pokémon with Drought (Torkoal being a prime example for its access to Eruption), as well as dedicated wallbreakers that can eliminate common Ivysaur checks like fast Fire, Psychic, or Flying-types. Conversely, Ivysaur must immediately flee from any opposing weather setters (e.g., Politoed with Drizzle, Tyranitar with Sand Stream) that negate its Chlorophyll advantage, as well as powerful special attackers or priority users that can exploit its inherent frailty.",
  "venusaur": "Venusaur's viability is primarily defined by its excellent synergy with sun support and its solid mixed bulk (80 HP / 83 Def / 100 SpD). Its Grass/Poison typing grants it resistances to common types like Fighting, Grass, and Fairy, while offering decent STAB coverage. Crucially, it lacks any 4x weaknesses, improving its survivability. Its true power lies with the Chlorophyll ability, which doubles its Speed under harsh sunlight, transforming it into a formidable Special Sweeper. However, this dependence on sun is its fatal flaw; outside of sun, its base 80 Speed is mediocre, and it becomes susceptible to common weaknesses like Fire, Flying, Ice, and Psychic, often relegated to a Bulky Attacker role or falling to lower competitive tiers without its weather.\n\nTo maximize Venusaur's potential, a Special Sweeper build leveraging Chlorophyll is mandatory. The core strategy revolves around maximizing its offensive presence in sun, making Life Orb the quintessential item for significant damage amplification. An optimal moveset includes Giga Drain or Leaf Storm for powerful Grass STAB (Same Type Attack Bonus), Sludge Bomb for Poison STAB with a poison chance, and Weather Ball, which becomes a 100 base power Fire-type move in sun, providing crucial coverage against Steel-types. The final slot is often Sleep Powder for status utility or Earth Power for specific coverage against Fire-types like Torkoal that might outspeed it under sun, or Heatran. EVs should be invested primarily in Special Attack and Speed (with Chlorophyll accounted for), with remaining EVs in HP for bulk.\n\nVenusaur is almost exclusively a mid-game attacker or late-game cleaner, brought in after sun has been established and opposing checks have been weakened. It is not a typical lead, as it requires field conditions to be set up. It synergizes perfectly with sun setters such as Torkoal (for Drought) or Ninetales-Alola (for Drought in earlier generations/formats). Entry hazard setters or physical walls that can draw attacks away from it are also excellent partners. Conversely, Venusaur must immediately flee from faster Fire-types (like Cinderace or opposing sun sweepers without prior speed control) that can remove it, strong Psychic-types (e.g., Tapu Lele), and any Pokémon carrying powerful Ice-type coverage that can OHKO it, especially if sun isn't active or removed. Weather removers or Taunt users also severely hinder its effectiveness.",
  "charmander": "**Viability Analysis**\nCharmander's greatest strengths are virtually non-existent in any competitive environment outside of the Little Cup (LC) format, where its baseline stats are balanced against other unevolved Pokémon. In standard VGC or Singles formats, its **abysmal base stats** across the board (HP 39, Attack 52, Defense 43, Special Attack 60, Special Defense 50, Speed 65) render it practically unusable. While its Fire typing offers resistances to common types like Grass, Bug, Steel, Ice, and Fairy, its defensive bulk is so low it struggles to even tank a neutral hit from a powerful attacker. Its ability, Blaze, offers a situational 1.5x boost to Fire-type moves when below 33% HP, which is unreliable and often irrelevant given how quickly Charmander is KO'd. Its fatal weaknesses are plentiful: a crippling 4x weakness to Rock (making Stealth Rock an **immediate game over** upon switch-in without a Focus Sash), and standard weaknesses to Water and Ground. Its tier in standard competitive play is effectively \"non-existent.\"\n\n**The Winning Strategy**\nTo even consider Charmander, we must operate under extremely niche conditions, often relying on gimmicks. The mandatory item to allow it any semblance of presence is **Focus Sash**, ensuring it can survive one hit and potentially retaliate or apply pressure. Without it, Charmander is a glass cannon that shatters before it fires. Its key ability is **Blaze**, as its hidden ability Solar Power is too risky and situational. Given its slightly higher Special Attack (60) over Attack (52), we would ideally run a Special Attacker set. An ideal move set would include **Flamethrower** or **Fire Blast** for reliable STAB (Same-Type Attack Bonus), **Dragon Pulse** for crucial coverage against Dragon-types, and **Focus Blast** as a high-power, albeit inaccurate, option against Rock and Steel types. In VGC, **Protect** is essential for scouting and turn management. Its role is strictly a hyper-specialized, highly conditional **revenge killer** or a desperate lead to exploit a very specific, favorable matchup. It cannot function as a Sweeper, Wall, or Pivot due to its complete lack of bulk, speed, or offensive power.\n\n**Game Plan**\nBringing Charmander onto the field is a strategic commitment that necessitates extreme caution. It should only be deployed as a **late-game cleaner** against severely weakened opponents, or to exploit a *guaranteed* one-hit KO against a specific Pokémon, typically a Grass or Bug-type that lacks super-effective coverage and is slower. It functions as a **fragile offensive presence** rather than a true lead. Teammates must provide overwhelming support: **entry hazard removal** (Defog/Rapid Spin) is absolutely critical to mitigate Stealth Rock damage. **Screens setters** (Light Screen/Reflect) can offer a momentary reprieve from damage, while **Tailwind support** might allow it to outspeed a handful of threats. Teammates like Pelipper (Drizzle + Defog) or specific Walls that can absorb Water/Ground attacks are beneficial. However, Charmander must **flee immediately** from virtually any common competitive threat. Powerful Water, Ground, and Rock-type attackers like Tapu Fini, Landorus-T, Excadrill, or even common neutral attackers will effortlessly one-shot it. Any Pokémon with access to priority moves or higher base Speed is an immense threat.",
  "charmeleon": "**Viability Analysis:**\nCharmeleon, as a Not Fully Evolved (NFE) Pokémon, suffers from a fatal flaw: its base stats are simply too low across the board to be competitively viable in any serious format (VGC, OU, UU, even RU). Its highest offensive stat is a paltry base 64 Special Attack, complemented by a poor base 58 Speed and utterly non-existent bulk (58 HP, 58 Defense, 65 Special Defense). Its Fire typing provides decent offensive STAB (Same-Type Attack Bonus) coverage but leaves it vulnerable to common Water, Ground, and Rock threats. Abilities like Blaze are too situational, and while Solar Power offers a significant Special Attack boost in sun, the constant HP drain coupled with Charmeleon's paper-thin defenses makes it incredibly fragile. Realistically, Charmeleon resides in the lowest competitive tiers, untiered for a reason; it is outclassed by virtually every other Fire-type and nearly every fully evolved Pokémon.\n\n**The Winning Strategy:**\nIf one were forced to utilize Charmeleon, the only feasible strategy revolves around maximizing its offensive output and attempting to patch its bulk. The mandatory item is **Eviolite**, which provides a 1.5x boost to its Defense and Special Defense, giving it a semblance of survivability against non-super effective hits. The key ability **Solar Power** is crucial; it converts Charmeleon into a pseudo-special sweeper under Sun, boosting its Special Attack by 1.5x at the cost of 1/8th of its max HP each turn. An ideal move set would include **Flamethrower** or **Fire Blast** for powerful STAB, **Solar Beam** to address its Water/Ground/Rock weaknesses (requiring a Power Herb for immediate use or Sun support), **Dragon Pulse** or **Focus Blast** for additional coverage, and **Protect** (especially in VGC) to scout and manage sun turns. Its role is strictly a frail, but potentially hard-hitting, Special Attacker operating under specific conditions.\n\n**Game Plan:**\nCharmeleon is absolutely not a lead, nor is it a reliable cleaner against anything but critically weakened targets. Its entry onto the field must be meticulously timed, ideally after a partner has successfully set up **Sun** via Drought (e.g., Torkoal). It synergizes heavily with these Sun setters, who also often carry Trick Room to compensate for its abysmal Speed, allowing it to move first and unleash powerful attacks. Other beneficial teammates include Pokémon capable of setting up screens (Reflect/Light Screen) to further enhance its Eviolite-boosted bulk, or those that can eliminate faster threats. Conversely, Charmeleon must flee immediately from anything that can change the weather (e.g., Pelipper's Drizzle, Hippowdon's Sand Stream), faster offensive threats that can one-shot it, or anything resisting its Fire STAB that isn't vulnerable to Solar Beam. It’s a niche, high-risk, high-reward pick that requires extensive team support to even function, let alone succeed.",
  "charizard": "Charizard's base form presents significant challenges in competitive play. Its base 109 Special Attack and 100 Speed are respectable but often outclassed by faster or more powerful threats in higher tiers. The Fire/Flying typing offers valuable resistances to Fighting, Bug, Grass, Steel, and Fairy, alongside an immunity to Ground. However, this typing comes with a crippling 4x weakness to Rock, making it uniquely vulnerable to Stealth Rock, an omnipresent entry hazard that drains 50% of its HP upon switch-in. This fundamental flaw severely limits its longevity and offensive presence. Its bulk (78/78/80) is mediocre, ensuring it struggles to take even neutrally effective hits. While Solar Power boosts its Special Attack significantly in sun, it comes with a detrimental HP drain, further exacerbating its frailty and dependence on specific weather conditions. Without its Mega Evolutions, Charizard typically resides in lower competitive tiers, often outclassed by more robust or offensively potent Fire and Flying types.\n\nTo maximize Charizard's limited potential, it must be geared as a Special Sweeper. The mandatory item choice is almost always Heavy-Duty Boots; this single item negates the devastating 4x Stealth Rock damage, making Charizard viable enough to switch in multiple times. Alternatively, if hazard control is absolutely guaranteed, a Life Orb can be used for raw power, or Choice Specs for an immediate wallbreaking presence. The preferred Ability is Solar Power, capitalizing on sun support to reach formidable Special Attack levels, though the HP drain requires careful management. A standard moveset includes Flamethrower or Fire Blast for reliable STAB (Same-Type Attack Bonus) Fire damage, and Air Slash for STAB Flying, offering a decent chance to flinch. Coverage options are crucial: Focus Blast hits Rock and Steel types that resist its STABs, while Solar Beam covers Water and other Rock types when under sun. Roost can provide recovery if running Heavy-Duty Boots, extending its sweep.\n\nCharizard is rarely a lead due to its extreme vulnerability to Stealth Rock; it's best deployed as a mid-to-late game cleaner or wallbreaker. Its optimal entry is after opposing entry hazards have been cleared by a Defogger or Rapid Spinner, or if it's wearing Heavy-Duty Boots, which allows for safer switches. If running Solar Power, Charizard shines when switched into pre-established sun from a teammate like Torkoal (Drought). Excellent teammates include hazard removers like Corviknight or Tornadus-T, and Sun setters. Pivots such as Scizor (U-turn) or Rotom-W (Volt Switch) can safely bring Charizard onto the field, preserving its limited bulk. Conversely, Charizard must immediately flee from any potent Rock-, Water-, or Electric-type attacker, especially those with priority moves or superior speed. Common threats include Tyranitar, Greninja, Tapu Koko, and any Pokémon capable of setting up or utilizing Stealth Rock before Charizard can effectively sweep.",
  "squirtle": "Squirtle presents a profound challenge in standard competitive formats due to its exceptionally low base stats across the board (44 HP, 48 Attack, 50 Special Attack, 43 Speed). Its bulk, even with a decent defensive typing of pure Water, is insufficient to survive hits from any serious threat outside of specific Little Cup (LC) environments. While pure Water provides only two weaknesses (Grass, Electric), these are offensively common types that will easily overpower Squirtle. Its abilities, Torrent and Rain Dish, offer situational boosts but are largely irrelevant given its inability to withstand damage or outspeed anything. Realistically, Squirtle is completely unviable in any format above LC, being severely outclassed by virtually every other Water-type Pokémon in every conceivable role.\n\nTo coax any semblance of competitive viability from Squirtle, one must operate strictly within the Little Cup format, where its relative stats become more proportionate. The mandatory item is Eviolite, which boosts its otherwise negligible defenses by 50%, allowing it to take at least one hit from non-super-effective attacks. The key ability is Torrent, providing a minor last-ditch boost to its Water-type STAB (Same-Type Attack Bonus) moves, as Rain Dish requires dedicated rain support, which is often too much commitment. Ideal moveset focuses on utility and coverage: Scald (Water STAB with a burn chance), Ice Beam (crucial coverage against Grass-types), Rapid Spin (hazard removal, invaluable in LC), and a utility slot like Yawn (forces switches) or Mirror Coat (reflects special attacks for surprise KOs). Its role is primarily a bulky pivot or hazard remover, not a sweeper or a dedicated wall.\n\nSquirtle's game plan is highly conditional, even in LC. It functions best as a reactive mid-game pivot or a potential lead for Rapid Spin against hazard-setting opponents. It is certainly not a cleaner, as its offensive presence is negligible. It synergizes well with teammates who appreciate hazard removal, like those weak to Stealth Rock, and Pokémon who can absorb or threaten Grass and Electric-type attacks. Squirtle absolutely must flee from any strong Grass or Electric-type special attacker, such as common LC threats like Chinchou, Magnemite, or Snivy. Even with Eviolite, its low base HP and Special Defense leave it vulnerable to being OHKO'd (One-Hit Knocked Out) or 2HKO'd (Two-Hit Knocked Out) by powerful STAB attacks from these common threats.",
  "wartortle": "Wartortle, a middle-stage evolution, faces a significant uphill battle in any competitive format beyond the most niche, like NFE (Non-Fully Evolved). Its greatest strength lies in its pure Water typing, offering decent defensive resistances to Fire, Water, Ice, and Steel, coupled with access to the crucial utility move Rapid Spin. Base 65 HP, 80 Defense, and 80 Special Defense, while poor for a fully evolved Pokémon, are respectable for its stage, hinting at some potential bulk. However, its fatal flaws are glaring: critically low offensive stats (base 63 Attack and Special Attack) render it incapable of being a meaningful threat, and a meager base 58 Speed ensures it will be outsped by virtually anything relevant. It has no 4x weaknesses but is vulnerable to common Electric and Grass-type attacks, and its sole standard ability, Torrent, offers minimal strategic impact compared to truly game-changing abilities. Realistically, Wartortle struggles to find a consistent role even in the lowest tiers, existing primarily as a novelty or within very specific NFE metagames where its utility can shine.\n\nThe optimal build for Wartortle pivots entirely on its niche as a utility Rapid Spinner. The mandatory item is **Eviolite**, which provides a 1.5x boost to its Defense and Special Defense, transforming its otherwise mediocre bulk into something genuinely usable. Its Key Ability remains **Torrent**, as its other ability, Rain Dish, is too situational. The ideal move set focuses on support and disruption: **Rapid Spin** is non-negotiable, serving as its primary justification for inclusion, clearing entry hazards like Stealth Rock and Spikes. **Scald** provides reliable STAB (Same-Type Attack Bonus) damage with a valuable 30% chance to inflict a burn, crippling physical attackers. **Fake Out** offers priority chip damage and flinching, useful for breaking Focus Sashes or securing a free turn. The final slot is flexible, with **Ice Beam** providing coverage against Grass-types, **Mirror Coat** punishing special attackers, or **Yawn** for phazing (forcing switches) or putting threats to sleep. Wartortle functions exclusively as a **Utility Pivot** or **Hazard Remover**, never a Sweeper or dedicated Wall.\n\nBringing Wartortle onto the field requires careful timing. It is not a Lead due to its lack of offensive pressure and vulnerability to faster threats, nor is it a Cleaner. Its best deployment is mid-game, coming in on resisted hits (Fire, Water, Ice, Steel) to safely remove entry hazards or provide Fake Out support. It synergizes exceptionally well with teammates that are weak to hazards, particularly Flying-types or Pokémon like Volcarona that rely on not taking chip damage. It also pairs well with physical attackers who appreciate Scald's burn potential or offensive Pokémon that benefit from its ability to force switches with Yawn. Conversely, Wartortle must immediately flee from powerful Electric and Grass-type threats, which exploit its critical weaknesses. Fast, hard-hitting special attackers can also overwhelm its Eviolite-boosted bulk quickly, making careful prediction and timely switching paramount to its survival and effectiveness.",
  "blastoise": "Blastoise, without its Mega Evolution or Gigantamax form, struggles significantly in higher competitive tiers due to power creep and a general lack of a distinct niche. Its greatest strengths lie in its solid defensive typing (pure Water, giving it only two common weaknesses: Electric and Grass) and decent special bulk (79 HP / 100 Def / 105 Sp. Def). This allows it to check specific Fire, Ice, and Steel-type threats. However, its offensive stats (83 Attack / 85 Special Attack) are woefully average, meaning it hits very softly without significant setup or conditions. Its Speed (78) is also unremarkable, leaving it outsped by most offensive threats. Blastoise's standard abilities, Torrent and Rain Dish, are situational at best; Torrent offers a conditional power boost, while Rain Dish requires dedicated rain support, a strategy often better executed by other Pokémon. Realistically, Blastoise exists in lower-to-mid tiers (RU/NU/UU) where its bulk and hazard removal utility are more appreciated. In VGC, its lack of offensive presence or unique support outside of specific G-Max mechanics usually relegates it to very niche team compositions.\n\nThe most viable strategy for Blastoise centers on its role as a **Bulky Support** or **Hazard Remover**. The mandatory item is **Leftovers** for passive recovery, enhancing its longevity. Its key ability remains **Torrent**, as Rain Dish's reliance on weather is too restrictive. An ideal move set includes **Rapid Spin** for hazard removal, **Scald** as a reliable Water STAB (Same Type Attack Bonus) with a valuable 30% burn chance to cripple physical attackers, and **Ice Beam** for crucial coverage against Grass-type threats that wall its primary STAB. The final slot is flexible, often filled by **Toxic** to wear down bulkier foes, **Yawn** for forced switches, **Haze** to reset stat changes, or **Protect** for scouting and Leftovers recovery. While a Shell Smash set exists (using White Herb to mitigate the defense drops), Blastoise's offensive stats and Speed are usually too low to capitalize effectively in most metas, making it a fragile sweep attempt often outclassed by faster or stronger Shell Smash users.\n\nIn terms of game plan, Blastoise functions best as a **mid-game pivot** or **cleaner** for entry hazards. Bring it onto the field when you anticipate an opponent's resisted attack (e.g., from a Fire or Steel type) or when an immediate threat of hazards (Stealth Rock, Spikes) needs addressing. It synergizes well with teammates that can cover its Grass and Electric weaknesses, such as Ground-types (e.g., Landorus-T, Excadrill) to absorb Electric attacks, or Grass-types (e.g., Amoonguss, Rillaboom) that can switch into Grass-type attacks and apply offensive pressure. It particularly appreciates partners that can wall or threaten common Electric and Grass-type Pokémon. Conversely, Blastoise must flee immediately from powerful Electric-type attackers like Zapdos or Raging Bolt, and strong Grass-type attackers such as Rillaboom or Ogerpon-W, as these can easily OHKO or heavily damage it despite its bulk. Additionally, strong special wallbreakers can overwhelm Blastoise's defenses even without super-effective coverage.",
  "caterpie": "Caterpie's competitive viability is, without hyperbole, non-existent. Its base stats are offensively and defensively abysmal across the board: 45 HP, 30 Attack, 35 Defense, 20 Special Attack, 20 Special Defense, and 45 Speed. These numbers place it firmly at the absolute bottom of any potential tier list, rendering it completely outclassed by every other Pokémon in the game. Its pure Bug typing offers resistances to Fighting, Ground, and Grass, but comes with critical weaknesses to Fire, Flying, and Rock, all common offensive types. Shield Dust, its sole ability, prevents secondary effects from moves, which is theoretically useful but utterly negated by Caterpie's extreme frailty; it will be OHKO'd by virtually any attack regardless of secondary effects. There are no 4x weaknesses, but its minimal bulk ensures any super-effective hit, or even neutral strong STAB (Same-Type Attack Bonus), results in an immediate knockout.\n\nAttempting to devise a \"winning strategy\" for Caterpie is an exercise in futility. Its build is entirely dictated by its severe limitations. The mandatory item is a Focus Sash to guarantee it survives one hit, allowing it to perform a single action. Its Key Ability, Shield Dust, is inherent and non-negotiable, offering its only shred of unique utility. The ideal move set is distressingly short: Tackle for minimal damage (STAB-boosted, but still negligible) and String Shot for a single-stage speed drop on a target. These are its only two naturally learned moves; it lacks access to any competitive TM, TR, or Egg Moves, leaving its remaining move slots empty and forcing Struggle if it were ever to deplete its PP. Its role is unequivocally that of a sacrificial \"turn burner\" or a novelty slot; it cannot function as a Sweeper, Wall, Pivot, or any other standard competitive archetype.\n\nThe game plan for deploying Caterpie is straightforward: do not. If forced onto the field in a specific scenario, perhaps as a desperate measure, it would serve as an emergency Lead to consume an opponent's initial turn with a Focus Sash-protected String Shot, hoping to cripple a faster threat for an incoming teammate. Teammate synergy is minimal; perhaps a Pokémon with Clear Body or White Smoke would appreciate the speed drop, or a partner like Justified Terrakion could potentially gain an Attack boost from a foe mistakenly targeting Caterpie with a Fighting-type move on a switch-in, though this is purely theoretical and unreliable. Threats it must flee from include every single Pokémon in existence; Caterpie is countered and OHKO'd by any offensive pressure whatsoever and offers no defensive or offensive presence to check anything.",
  "metapod": "Metapod's viability in any competitive format, VGC or Singles, is non-existent. Its base stats are catastrophically low across the board: 50 HP, 20 Attack, 25 Special Attack, 30 Speed, with its highest stats being a meager 55 Defense and 25 Special Defense. This paltry stat distribution, combined with a Bug typing that offers only three resistances (Fighting, Grass, Ground) and three common weaknesses (Fire, Rock, Flying), results in zero defensive or offensive presence. Its sole ability, Shed Skin, offers a 30% chance of status recovery, but Metapod lacks the bulk to survive long enough for this to reliably activate. Realistically, Metapod cannot endure even a single neutral-effective hit from any established threat, making it an immediate liability in battle and firmly placing it in the \"unviable\" tier, far below even the most niche Little Cup considerations.\n\nGiven Metapod's profound limitations, constructing a \"winning strategy\" is largely a conceptual exercise, focusing on mitigating its extreme fragility rather than enabling genuine threat potential. The mandatory item is Eviolite, which would slightly bolster its poor defensive stats, though still leaving it incredibly frail. Its only ability is Shed Skin, which offers a negligible chance of status removal that it rarely gets to capitalize on. An \"ideal\" (though still critically flawed) moveset would maximize its one turn on the field: Harden to attempt a desperate Defense boost, and potentially Electroweb (via TR) for a weak, Special-based Speed drop on an opponent, or String Shot (via Caterpie's natural movepool) for a similar utility. Protect could also be considered to scout or stall a turn for Shed Skin. Despite these attempts, its role is not a Sweeper, Wall, or Pivot, but rather a \"speed bump\" – a Pokémon meant to absorb a single attack, perhaps trigger a minor effect, and then faint.\n\nDeploying Metapod effectively is practically impossible, as it serves no strategic purpose beyond being a forced switch-in. If absolutely necessary, it might be brought out as a lead against a highly passive opponent or one whose primary attacks it resists, purely to attempt a single Harden or Electroweb before being removed. It has no cleaning potential whatsoever. Synergies are virtually non-existent; Metapod cannot reliably support any teammate due to its frailty and lack of utility. It struggles against all threats, but it must immediately flee from any Pokémon with super-effective Flying, Rock, or Fire STAB (Same-Type Attack Bonus) moves, as these will invariably result in an immediate one-hit knockout. Ultimately, a successful game plan involving Metapod would involve not bringing it to battle at all.",
  "butterfree": "Butterfree, a Bug/Flying type, struggles immensely in competitive play due to its crippling defensive profile (60 HP / 50 Def / 80 SpD) and an abysmal 4x weakness to Rock, making Stealth Rock an immediate game-ender without Heavy-Duty Boots. Its Speed stat of 70 is insufficient for a sweeper, and while its 90 Special Attack is passable, it lacks the raw power to truly threaten robust walls. Its primary competitive \"strength\" lies solely in its Compound Eyes ability, which boosts the accuracy of its signature Sleep Powder to a reliable 97.5%. This singular niche, however, isn't enough to elevate it beyond the lowest tiers (PU/ZU), where it can occasionally function as a disruptive element but is overwhelmingly outclassed by more durable or powerful options with similar utility.\n\nTo make Butterfree remotely viable, you are entirely beholden to its Compound Eyes ability and its access to Sleep Powder. The mandatory item is almost always Heavy-Duty Boots to negate its fatal Stealth Rock weakness, or potentially a Focus Sash for one guaranteed action against faster threats. The core move set revolves around Sleep Powder to incapacitate a foe, followed by Quiver Dance to boost its Special Attack, Special Defense, and Speed. This makes it a highly conditional setup sweeper. Its STAB attacks are typically Bug Buzz and Hurricane (benefiting from Compound Eyes' accuracy boost to 91%), providing decent coverage. Butterfree's role is strictly a niche disruption and late-game cleaner or setup sweeper, not a bulky pivot or physical attacker.\n\nButterfree's optimal deployment is either as an early-game lead to attempt a Sleep Powder on a crucial threat, or a late-game cleaner once opposing walls and faster threats have been sufficiently weakened or removed. It absolutely demands robust hazard control from teammates, typically Defog or Rapid Spin users, to preserve its Heavy-Duty Boots or prevent its immediate demise without it. Teammates that can absorb Electric, Fire, Flying, and Ice attacks are also crucial. Strong offensive partners that can break down Steel or Rock types are ideal to clear its path. Conversely, Butterfree must flee immediately from virtually any Pokémon with Rock-type STAB, faster offensive threats, especially Choice Scarf users, or Pokémon with Taunt that shut down its entire strategy. Its presence is a massive liability if the opponent has a reliable switch-in that threatens it directly.",
  "weedle": "Weedle presents a unique challenge for competitive analysis, largely due to its foundational stat spread which is, frankly, catastrophic. Its base 40 HP, 30 Attack, 35 Defense, 20 Special Attack, 20 Special Defense, and 50 Speed ensure it is outclassed in every conceivable metric by virtually every other Pokémon. Its Bug/Poison typing offers STAB (Same-Type Attack Bonus) on two types, but also leaves it with common weaknesses to Fire, Flying, Psychic, and Rock-type attacks, which are prevalent in most competitive metagames. Coupled with its non-existent bulk (HP, Defense, Special Defense) and offensive presence (Attack, Special Attack), it struggles to survive even neutral hits or deal meaningful damage. Its sole ability, Shield Dust, preventing secondary effects of opposing moves, is functionally irrelevant given its inability to withstand primary damage. As a un-evolved Pokémon with no access to Eviolite or stat-boosting items that would make a difference, Weedle occupies the absolute lowest rung of competitive viability, strictly confined to the joke tier.\n\nGiven these constraints, a \"winning strategy\" for Weedle is paradoxical, but if forced onto a team, it attempts to function as a hyper-niche, suicidal disruptor. The mandatory item is a Focus Sash, ensuring it survives one hit to guarantee an action. Its key ability is Shield Dust, its only option, offering no practical advantage. The ideal moveset would comprise Poison Sting (for a 30% chance to inflict poison, a low-power STAB attack), Bug Bite (a low-power STAB attack that can consume berries, offering minimal utility), String Shot (to lower an opponent's Speed stat by two stages, potentially aiding a slower teammate), and Protect (to scout opponents' moves in VGC or stall a turn, though rarely effective with Weedle's fragility). Its role is not that of a Sweeper, Wall, or Pivot, but rather a sacrificial lead aiming to inflict a status condition or lower Speed before inevitably being removed.\n\nDeploying Weedle requires extreme precision and foresight into a game state that simply does not exist in high-level play. It cannot be brought in as a Lead, as virtually any lead Pokémon will effortlessly OHKO (One-Hit Knock Out) it. It cannot be a Cleaner, as it lacks the offensive power to finish off weakened targets. Its only theoretical use is as a desperate switch-in against a passive threat or a setup sweeper that might be attempting to boost against it, hoping to land a poison or a String Shot before fainting. Teammates would ideally be Pokémon that could capitalize on a minor Speed drop or a status effect, perhaps a slower offensive threat that benefits from String Shot, or a stall Pokémon that appreciates a poisoned opponent. However, the risk-reward is heavily skewed against this. Weedle must flee from literally *any* offensive threat, including common setup sweepers like Dragapult or Urshifu, or even Pokémon with priority moves, which would bypass its Focus Sash if already damaged, or simply outspeed and OHKO it through residual damage. Its usage implies a team composition utterly lacking in competitive alternatives."
}